# Brewfile

# Install command-line tools using Homebrew.

# Tap sources
# ================
tap "phinze/cask"
tap "AdoptOpenJDK/openjdk"
tap "homebrew/cask-fonts"


# Install formulas
# ================
# install brew forumlas
brew "svn"
brew "git-flow"
brew "git"
brew "watchman"
brew "wget"
brew "yarn"
brew "youtube-dl"
brew "zlib"
brew "zsh"
brew "zsh-completions"

# install cask forumlas:
# install custom powerline fonts for dev and terminal
cask "font-menlo-for-powerline"
cask "font-fira-mono-for-powerline"
cask "font-source-code-pro-for-powerline"
cask "font-powerline-symbols"
cask "font-fira-code"

cask "iterm2"
# cask "google-chrome"
cask "visual-studio-code"
# cask "slack"
cask "spectacle"

# this requires a password so rather do it in the boostrap.sh
cask "adoptopenjdk8"
